# GetHCurveTangentAtStation Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..GetHCurveTangentAtStation Method
Alignment Class See Also
---
Calculate 2d (X and Y components of returned vector) horizontal tangent at given station.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public XYZ GetHCurveTangentAtStation(
	double station
)
```

Visual Basic
---
```text
Public Function GetHCurveTangentAtStation ( _
	station As Double _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetHCurveTangentAtStation(
	double station
)
```

# ### Parameters
station
    Type: System..::..DoubleAlignment station to calculate 2d horizontal tangent for, in Revit internal model units (standard Imperial feet).
# ### Return Value
2d (X and Y components of returned vector) horizontal tangent at given station.
# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace